import { Link } from 'react-router-dom';

const Footer = () => {
	return (
		<div className='footer'>
			<div className='container'>
				<div className='footer__content'>
					<div className='footer__support'>
						<h3 className='footer__support-title'>Мессенджеры</h3>
						<ul className='footer__messenger-list'>
							<li className='footer__messenger-item'>
								<Link className='footer__messenger-link' to={'/'}>
									<svg
										className='footer__messenger-icon-whatsApp'
										xmlns='http://www.w3.org/2000/svg'
										viewBox='0 0 215 215'
									>
										<defs></defs>
										<g id='WhatsApp'>
											<circle
												className='footer__whatsApp-1'
												fill='currentColor'
												cx='107.5'
												cy='107.5'
												r='107.5'
											/>
											<g data-name='WhatsApp'>
												<path
													className='footer__whatsApp-2'
													fill='currentColor'
													data-name='WhatsApp'
													d='M885.91,161l7.55-27.56a53.18,53.18,0,1,1,46.09,26.64h0a53.18,53.18,0,0,1-25.41-6.48Zm29.5-17,1.62,1a44.21,44.21,0,0,0,22.5,6.17h0a44.22,44.22,0,1,0-37.45-20.72l1,1.67-4.47,16.31Z'
													transform='translate(-831)'
												/>
												<path
													className='footer__whatsApp-3'
													fill='currentColor'
													data-name='WhatsApp'
													d='M966.34,119.54c-.33-.56-1.22-.89-2.55-1.55s-7.86-3.88-9.08-4.33-2.1-.66-3,.67-3.43,4.32-4.2,5.21-1.56,1-2.88.33A36.31,36.31,0,0,1,934,113.28a40,40,0,0,1-7.39-9.21c-.78-1.33-.09-2,.58-2.71s1.33-1.56,2-2.33a8.84,8.84,0,0,0,1.33-2.22,2.47,2.47,0,0,0-.11-2.33c-.33-.66-3-7.2-4.1-9.86s-2.17-2.24-3-2.29-1.66,0-2.54,0A4.89,4.89,0,0,0,917.17,84,14.91,14.91,0,0,0,912.52,95c0,6.54,4.76,12.86,5.43,13.75s9.37,14.31,22.7,20.06a75.55,75.55,0,0,0,7.58,2.8,18.27,18.27,0,0,0,8.37.53c2.55-.38,7.86-3.22,9-6.32S966.67,120.09,966.34,119.54Z'
													transform='translate(-831)'
												/>
											</g>
										</g>
									</svg>
								</Link>
							</li>
							<li className='footer__messenger-item'>
								<Link className='footer__messenger-link' to={'/'}>
									<svg
										className='footer__messenger-icon-facebook'
										xmlns='http://www.w3.org/2000/svg'
										viewBox='0 0 215 215'
									>
										<defs></defs>
										<g id='Facebook'>
											<circle className='footer__facebook-1' fill='currentColor' cx='107.5' cy='107.5' r='107.5' />
											<path
												data-name='Facebook'
												className='footer__facebook-2'
												fill='currentColor'
												d='M1223.69,116.65h18l3.43-22.45h-21.41V79.64c0-6.14,3-12.13,12.58-12.13H1246V48.4a117.7,117.7,0,0,0-17.28-1.52c-17.63,0-29.15,10.75-29.15,30.22V94.2H1180v22.45h19.59v54.26h24.12Z'
												transform='translate(-1108)'
											/>
										</g>
									</svg>
								</Link>
							</li>
							<li className='footer__messenger-item'>
								<Link className='footer__messenger-link' to={'/'}>
									<svg
										className='footer__messenger-icon-instagram'
										version='1.1'
										xmlns='http://www.w3.org/2000/svg'
										xmlnsXlink='http://www.w3.org/1999/xlink'
										x='0px'
										y='0px'
										viewBox='0 0 291.319 291.319'
										xmlSpace='preserve'
									>
										<g>
											<path
												className='footer__instagram-1'
												d='M145.659,0c80.44,0,145.66,65.219,145.66,145.66S226.1,291.319,145.66,291.319S0,226.1,0,145.66 S65.21,0,145.659,0z'
												fill='currentColor'
											></path>
											<path
												className='footer__instagram-2'
												d='M195.93,63.708H95.38c-17.47,0-31.672,14.211-31.672,31.672v100.56 c0,17.47,14.211,31.672,31.672,31.672h100.56c17.47,0,31.672-14.211,31.672-31.672V95.38 C227.611,77.919,213.4,63.708,195.93,63.708z M205.908,82.034l3.587-0.009v27.202l-27.402,0.091l-0.091-27.202 C182.002,82.116,205.908,82.034,205.908,82.034z M145.66,118.239c22.732,0,27.42,21.339,27.42,27.429 c0,15.103-12.308,27.411-27.42,27.411c-15.121,0-27.42-12.308-27.42-27.411C118.23,139.578,122.928,118.239,145.66,118.239z M209.65,193.955c0,8.658-7.037,15.704-15.713,15.704H97.073c-8.667,0-15.713-7.037-15.713-15.704v-66.539h22.759 c-2.112,5.198-3.305,12.299-3.305,18.253c0,24.708,20.101,44.818,44.818,44.818s44.808-20.11,44.808-44.818 c0-5.954-1.193-13.055-3.296-18.253h22.486v66.539L209.65,193.955z'
												fill='currentColor'
											></path>
										</g>
									</svg>
								</Link>
							</li>
							<li className='footer__messenger-item'>
								<Link className='footer__messenger-link' to={'/'}>
									<svg
										className='footer__messenger-icon-vk'
										version='1.1'
										xmlns='http://www.w3.org/2000/svg'
										xmlnsXlink='http://www.w3.org/1999/xlink'
										x='0px'
										y='0px'
										viewBox='0 0 112.196 112.196'
										xmlSpace='preserve'
									>
										<g>
											<g>
												<circle
													className='footer__vk-1'
													cx='56.098'
													cy='56.098'
													r='56.098'
													fill='currentColor'
												></circle>
											</g>
											<path
												className='footer__vk-2'
												d='M53.979,80.702h4.403c0,0,1.33-0.146,2.009-0.878 c0.625-0.672,0.605-1.934,0.605-1.934s-0.086-5.908,2.656-6.778c2.703-0.857,6.174,5.71,9.853,8.235 c2.782,1.911,4.896,1.492,4.896,1.492l9.837-0.137c0,0,5.146-0.317,2.706-4.363c-0.2-0.331-1.421-2.993-7.314-8.463 c-6.168-5.725-5.342-4.799,2.088-14.702c4.525-6.031,6.334-9.713,5.769-11.29c-0.539-1.502-3.867-1.105-3.867-1.105l-11.076,0.069 c0,0-0.821-0.112-1.43,0.252c-0.595,0.357-0.978,1.189-0.978,1.189s-1.753,4.667-4.091,8.636c-4.932,8.375-6.904,8.817-7.71,8.297 c-1.875-1.212-1.407-4.869-1.407-7.467c0-8.116,1.231-11.5-2.397-12.376c-1.204-0.291-2.09-0.483-5.169-0.514 c-3.952-0.041-7.297,0.012-9.191,0.94c-1.26,0.617-2.232,1.992-1.64,2.071c0.732,0.098,2.39,0.447,3.269,1.644 c1.135,1.544,1.095,5.012,1.095,5.012s0.652,9.554-1.523,10.741c-1.493,0.814-3.541-0.848-7.938-8.446 c-2.253-3.892-3.954-8.194-3.954-8.194s-0.328-0.804-0.913-1.234c-0.71-0.521-1.702-0.687-1.702-0.687l-10.525,0.069 c0,0-1.58,0.044-2.16,0.731c-0.516,0.611-0.041,1.875-0.041,1.875s8.24,19.278,17.57,28.993 C44.264,81.287,53.979,80.702,53.979,80.702L53.979,80.702z'
												fill='currentColor'
											></path>
										</g>
									</svg>
								</Link>
							</li>
							<li className='footer__messenger-item'>
								<Link className='footer__messenger-link' to={'/'}>
									<svg
										className='footer__messenger-icon-youtube'
										version='1.1'
										xmlns='http://www.w3.org/2000/svg'
										xmlnsXlink='http://www.w3.org/1999/xlink'
										x='0px'
										y='0px'
										viewBox='0 0 473.931 473.931'
										xmlSpace='preserve'
									>
										<circle
											className='footer__youtube-1'
											cx='236.966'
											cy='236.966'
											r='236.966'
											fill='currentColor'
										></circle>
										<path
											className='footer__youtube-2'
											d='M404.518,69.38c92.541,92.549,92.549,242.593,0,335.142c-92.541,92.541-242.593,92.545-335.142,0 L404.518,69.38z'
											fill='currentColor'
										></path>
										<path
											className='footer__youtube-3'
											d='M470.321,277.964L310.843,118.487l-12.864,12.864l-12.864-12.864l-14.099,14.099l9.47,9.47 l-3.091,3.091l-24.557-24.557l-1.048,1.055l-33.092-33.092l-14.099,14.099l3.858,3.858l-5.665,5.665l-23.854-23.854l-9.889,9.889 l23.255,56.003l-10.473,42.997l28.632,28.639l-72.418,5.066l-1.096,125.667l116.537,116.679 C362.678,465.505,451.836,383.833,470.321,277.964z'
											fill='currentColor'
										></path>
										<path
											className='footer__youtube-4'
											d='M321.724,291.91h-15.289l0.075-8.875c0-3.948,3.237-7.169,7.199-7.169h0.98 c3.963,0,7.214,3.222,7.214,7.169L321.724,291.91z M264.404,272.89c-3.865,0-7.038,2.608-7.038,5.796v43.161 c0,3.188,3.173,5.781,7.038,5.781c3.895,0,7.068-2.593,7.068-5.781v-43.165C271.472,275.498,268.299,272.89,264.404,272.89z M357.473,248.752v82.102c0,19.697-17.077,35.809-37.96,35.809H163.444c-20.887,0-37.96-16.116-37.96-35.809v-82.102 c0-19.697,17.074-35.816,37.96-35.816h156.073C340.395,212.936,357.473,229.059,357.473,248.752z M173.85,339.771l-0.007-86.487 l19.345,0.007v-12.819l-51.573-0.079v12.595l16.101,0.049v86.73h16.134V339.771z M231.847,266.17h-16.131v46.181 c0,6.683,0.4,10.024-0.022,11.199c-1.317,3.581-7.214,7.383-9.508,0.389c-0.389-1.227-0.045-4.924-0.052-11.274l-0.075-46.499 h-16.041l0.06,45.765c0.007,7.016-0.161,12.247,0.052,14.627c0.393,4.198,0.247,9.096,4.15,11.884 c7.252,5.235,21.163-0.778,24.643-8.251l-0.03,9.534l12.95,0.019V266.17H231.847z M283.45,319.052l-0.03-38.439 c-0.015-14.653-10.971-23.427-25.856-11.573l0.067-28.58l-16.116,0.026l-0.079,98.637l13.25-0.195l1.205-6.148 C272.83,348.332,283.479,337.683,283.45,319.052z M333.941,313.96l-12.101,0.064c0,0.483-0.022,1.033-0.03,1.639v6.75 c0,3.611-2.982,6.552-6.608,6.552h-2.369c-3.633,0-6.615-2.941-6.615-6.552v-0.748v-7.431v-9.579h27.697V294.23 c0-7.614-0.198-15.229-0.827-19.584c-1.979-13.781-21.317-15.966-31.09-8.913c-3.068,2.204-5.407,5.152-6.776,9.119 c-1.373,3.963-2.054,9.369-2.054,16.247v22.918C293.178,352.115,339.452,346.73,333.941,313.96z M271.895,189.524 c0.827,2.028,2.118,3.663,3.88,4.905c1.725,1.212,3.948,1.83,6.6,1.83c2.324,0,4.385-0.629,6.174-1.927 c1.792-1.291,3.304-3.214,4.531-5.788l-0.307,6.331h17.979v-76.467h-14.155v59.513c0,3.218-2.66,5.856-5.905,5.856 c-3.222,0-5.89-2.638-5.89-5.856v-59.513h-14.769v51.573c0,6.571,0.116,10.952,0.314,13.175 C270.559,185.363,271.064,187.477,271.895,189.524z M217.408,146.337c0-7.341,0.614-13.07,1.826-17.201 c1.22-4.12,3.427-7.431,6.608-9.923c3.18-2.511,7.252-3.764,12.191-3.764c4.157,0,7.723,0.819,10.705,2.417 c2.982,1.609,5.298,3.693,6.892,6.271c1.639,2.586,2.739,5.246,3.334,7.966c0.606,2.754,0.898,6.919,0.898,12.52v19.341 c0,7.094-0.284,12.31-0.834,15.626c-0.543,3.323-1.717,6.402-3.536,9.287c-1.796,2.859-4.116,4.995-6.93,6.357 c-2.836,1.381-6.08,2.054-9.755,2.054c-4.093,0-7.551-0.565-10.391-1.751c-2.851-1.175-5.059-2.949-6.627-5.302 c-1.594-2.357-2.705-5.227-3.375-8.572c-0.681-3.349-1.003-8.374-1.003-15.079v-20.247H217.408z M231.484,176.716 c0,4.325,3.229,7.861,7.154,7.861s7.132-3.532,7.132-7.861v-40.71c0-4.325-3.207-7.861-7.132-7.861s-7.154,3.532-7.154,7.861 V176.716z M181.722,197.269h16.969l0.015-58.648l20.045-50.241h-18.555l-10.657,37.324l-10.81-37.421h-18.357l21.324,50.372 L181.722,197.269z'
											fill='currentColor'
										></path>
									</svg>
								</Link>
							</li>
							<li className='footer__messenger-item'>
								<Link className='footer__messenger-link' to={'/'}>
									<svg
										className='footer__messenger-icon-telegram'
										enable-background='new 0 0 24 24'
										viewBox='0 0 24 24'
										xmlns='http://www.w3.org/2000/svg'
									>
										<circle
											className='footer__telegram-1'
											cx='12'
											cy='12'
											fill='currentColor'
											r='12'
										></circle>
										<path
											className='footer__telegram-2'
											d='m5.491 11.74 11.57-4.461c.537-.194 1.006.131.832.943l.001-.001-1.97 9.281c-.146.658-.537.818-1.084.508l-3-2.211-1.447 1.394c-.16.16-.295.295-.605.295l.213-3.053 5.56-5.023c.242-.213-.054-.333-.373-.121l-6.871 4.326-2.962-.924c-.643-.204-.657-.643.136-.953z'
											fill='currentColor'
										></path>
									</svg>
								</Link>
							</li>
						</ul>
						<h3 className='footer__support-title'>Поддержка</h3>
						<ul className='footer__support-list'>
							<li className='footer__support-item'>
								<Link className='footer__support-item-link' to={'/'}>
									Главная страница
								</Link>
							</li>
							<li className='footer__support-item'>
								<Link className='footer__support-item-link' to={'/'}>
									Контакты
								</Link>
							</li>
							<li className='footer__support-item'>
								<Link className='footer__support-item-link' to={'/'}>
									Сообщить об ошибке
								</Link>
							</li>
							<li className='footer__support-item'>
								<Link className='footer__support-item-link' to={'/'}>
									Карьера
								</Link>
							</li>
							<li className='footer__support-item'>
								<Link className='footer__support-item-link' to={'/'}>
									Пользовотельское соглашение
								</Link>
							</li>
							<li className='footer__support-item'>
								<Link className='footer__support-item-link' to={'/'}>
									Политика конфидинциальности
								</Link>
							</li>
						</ul>
					</div>
					<p className='footer__copyright'>
						Авторское право "СК Фаворит" © 2025 - Все права защищены
					</p>
				</div>
			</div>
		</div>
	);
};

export default Footer;
